tutorials/fluidSolidInteraction/HronTurekFsi3/laminar/constant/fluid/fluidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fluidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluidModel    icoFluid;

icoFluidCoeffs
{
    // nCorrectors 3;
    // nNonOrthogonalCorrectors 1;
    // nOuterCorrectors 1;
}

// ************************************************************************* //
